cf_billing/Catalogs/макрПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>макрПечатныеФормы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.макрОбъектыКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПрикрепленногоФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.макрВидыПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonForms/макрДополнительныеОтчетыИОбработкиМакросные/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяРаздела = Параметры.ИмяРаздела;
	
	ВидОбработокСтрока = Параметры.Вид;
	
	Если	  ВидОбработокСтрока = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиЗаполнениеОбъекта() Тогда
		Заголовок = НСтр("ru = 'Команды заполнения объектов'");
	ИначеЕсли ВидОбработокСтрока = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиОтчет() Тогда
		Заголовок = НСтр("ru = 'Отчеты'");
	ИначеЕсли ВидОбработокСтрока = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма() Тогда
		Заголовок = НСтр("ru = 'Дополнительные печатные формы'");
	ИначеЕсли ВидОбработокСтрока = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиСозданиеСвязанныхОбъектов() Тогда
		Заголовок = НСтр("ru = 'Команды создания связанных объектов'");
	ИначеЕсли ВидОбработокСтрока = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка() Тогда
		Заголовок = НСтр("ru = 'Дополнительные обработки ('") + ДополнительныеОтчетыИОбработки.ПолучитьИмяРабочегоМеста(ИмяРаздела) + ")";
	ИначеЕсли ВидОбработокСтрока = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет()Тогда
		Заголовок = НСтр("ru = 'Дополнительные отчеты ('") + ДополнительныеОтчетыИОбработки.ПолучитьИмяРабочегоМеста(ИмяРаздела) + ")";
	КонецЕсли;
	
	ВидОбработок = ДополнительныеОтчетыИОбработки.ПолучитьВидОбработкиПоСтроковомуПредставлениюВида(ВидОбработокСтрока);
	
	Если ВидОбработок = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет
	 ИЛИ ВидОбработок = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет Тогда
		Элементы.НастроитьСписокБыстрогоДоступа.Заголовок = НСтр("ru = 'Настроить список моих отчетов'");
	Иначе
		Элементы.НастроитьСписокБыстрогоДоступа.Заголовок = НСтр("ru = 'Настроить список моих обработок'");
	КонецЕсли;
	
	ЭтоГлобальныеОбработки = ДополнительныеОтчетыИОбработки.ПроверитьГлобальнаяОбработка(ВидОбработок);
	
	ЭтоНазначаемыеОбработки = ПроверитьНазначаемаяОбработка(ВидОбработок);
	
	Если ЭтоНазначаемыеОбработки Тогда
		
		Элементы.НастроитьСписокБыстрогоДоступа.Видимость = Ложь;
		
		ОбъектыНазначения.ЗагрузитьЗначения(Параметры.ОбъектыНазначения.ВыгрузитьЗначения());
		ОбНазначенияСсылка = ОбъектыНазначения.Получить(0).Значение;
		МетаданныеОбНазначения = ОбъектыНазначения.Получить(0).Значение.Метаданные();
		
		ПолноеИмяОбъектаМетаданных = МетаданныеОбНазначения.ПолноеИмя();
		
		ЭтоФормаОбъекта = ЭтоФормаОбъекта(ПолноеИмяОбъектаМетаданных, Параметры.ИмяФормы);
		
	КонецЕсли;
	
	ЗаполнитьТаблицуОбработок();
	
КонецПроцедуры

&НаСервере
Функция ЭтоФормаОбъекта(ПолноеИмяОбъектаМетаданных, ИмяФормы) Экспорт
	
	ОбъектМетаданных = ПолучитьОбъектМетаданныхПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	Если ОбъектМетаданных.ОсновнаяФормаОбъекта <> Неопределено Тогда
		Если ОбъектМетаданных.ОсновнаяФормаОбъекта.ПолноеИмя() = ИмяФормы Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ОбъектМетаданных.ОсновнаяФормаОбъекта  <> Неопределено Тогда
		Если ОбъектМетаданных.ОсновнаяФормаСписка.ПолноеИмя() = ИмяФормы Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
		Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьОбъектМетаданныхПоПолномуИмени(ПолноеИмя) Экспорт
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмя, ".");
	
	КлассОМ = ЧастиИмени[0];
	ИмяОМ	= ЧастиИмени[1];
	
	Если      ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Возврат Метаданные.Справочники[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Возврат Метаданные.Документы[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Возврат Метаданные.БизнесПроцессы[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Возврат Метаданные.ПланыВидовХарактеристик[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Возврат Метаданные.ПланыСчетов[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Возврат Метаданные.ПланЫВидовРасчета[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Возврат Метаданные.Задачи[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Возврат Метаданные.ПланыОбмена[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Возврат Метаданные.Перечисления[ИмяОМ];
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Возврат Метаданные.Обработки[ИмяОМ];
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Неизвестный тип объекта метаданных (%1)'"), КлассОМ);
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПроверитьГлобальнаяОбработка(Вид) Экспорт
	
	Возврат (Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка)
		ИЛИ (Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет);
	
КонецФункции

// Проверяет, что обработка относится к категории назначаемых для обектов
// Параметры
// Вид - ПеречислениеСсылка.ВидыДополнительныхОтчетовИОбработок - вид обработки
// Возвращаемое значение
//	Истина - обработка относится к категории назначаемых
//	Ложь   - обработка относится к категории глобальных
//
&НаСервере
Функция ПроверитьНазначаемаяОбработка(Вид) Экспорт
	
	Возврат Не ПроверитьГлобальнаяОбработка(Вид);
	
КонецФункции

&НаСервере
Функция ПолучитьДоступныеКоманды(ЭтоНазначаемыеОбработки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "
			|ВЫБРАТЬ
			|	ДополнительныеОтчетыИОбработкиКоманды.Представление КАК Представление,
			|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор КАК Идентификатор,
			|	ДополнительныеОтчетыИОбработкиКоманды.ПоказыватьОповещение КАК ПоказыватьОповещение,
			|	ДополнительныеОтчетыИОбработкиКоманды.Модификатор КАК Модификатор,
			|	ВЫБОР
			|		КОГДА ДополнительныеОтчетыИОбработкиКоманды.ВариантЗапуска = ЗНАЧЕНИЕ(Перечисление.СпособыВызоваДополнительныхОбработок.ВызовКлиентскогоМетода)
			|			ТОГДА ""ВызовКлиентскогоМетода""
			|		КОГДА ДополнительныеОтчетыИОбработкиКоманды.ВариантЗапуска = ЗНАЧЕНИЕ(Перечисление.СпособыВызоваДополнительныхОбработок.ВызовСерверногоМетода)
			|			ТОГДА ""ВызовСерверногоМетода""
			|		КОГДА ДополнительныеОтчетыИОбработкиКоманды.ВариантЗапуска = ЗНАЧЕНИЕ(Перечисление.СпособыВызоваДополнительныхОбработок.ОткрытиеФормы)
			|			ТОГДА ""ОткрытиеФормы""
			|	КОНЕЦ КАК ВариантЗапуска,
			|	ДополнительныеОтчетыИОбработки.Ссылка			КАК Ссылка,
			|	ДополнительныеОтчетыИОбработки.БезопасныйРежим	КАК БезопасныйРежим
			|ИЗ
			|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
			|	СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
			|			ПО ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработки.Ссылка";
	
	Если ЭтоНазначаемыеОбработки Тогда
		ТекстЗапроса = ТекстЗапроса + "
			|	СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Назначение КАК ДополнительныеОтчетыИОбработкиНазначение
			|			ПО ДополнительныеОтчетыИОбработкиНазначение.Ссылка = ДополнительныеОтчетыИОбработки.Ссылка";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
			|	СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Разделы КАК ДополнительныеОтчетыИОбработкиРазделы
			|			ПО ДополнительныеОтчетыИОбработкиРазделы.Ссылка = ДополнительныеОтчетыИОбработки.Ссылка";
	КонецЕсли;
		
	ТекстЗапроса = ТекстЗапроса + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПользовательскиеНастройкиДоступаКОбработкам КАК ПользовательскиеНастройкиДоступаКОбработкам
		|			ПО ПользовательскиеНастройкиДоступаКОбработкам.ДополнительныйОтчетИлиОбработка = ДополнительныеОтчетыИОбработки.Ссылка
		|			 И ПользовательскиеНастройкиДоступаКОбработкам.ИдентификаторКоманды = ДополнительныеОтчетыИОбработкиКоманды.Идентификатор
		|			 И ПользовательскиеНастройкиДоступаКОбработкам.Пользователь = &Пользователь";
	
	Запрос.Параметры.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	
	ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ
			|	ДополнительныеОтчетыИОбработки.Вид = &ВидОбработок
			|	И НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
			|	И (
			|		ДополнительныеОтчетыИОбработки.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.Используется)";
			
	Если РольДоступна(Метаданные.Роли.ДобавлениеИзменениеДополнительныхОтчетовИОбработок)
		ИЛИ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		ТекстЗапроса = ТекстЗапроса + "
			|	ИЛИ ДополнительныеОтчетыИОбработки.Публикация = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииДополнительныхОтчетовИОбработок.РежимОтладки)";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
									| )";
	
	Если ЭтоНазначаемыеОбработки Тогда
		
		Если ЭтоФормаОбъекта Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|	И ДополнительныеОтчетыИОбработки.ИспользоватьДляФормыОбъекта";
		Иначе
			ТекстЗапроса = ТекстЗапроса + "
			|	И ДополнительныеОтчетыИОбработки.ИспользоватьДляФормыСписка";
		КонецЕсли;
		
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
			|	И ДополнительныеОтчетыИОбработкиРазделы.ИмяРаздела = &ИмяРаздела";
		
		Запрос.Параметры.Вставить("ИмяРаздела", ИмяРаздела);
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	//
	Запрос.Параметры.Вставить("ВидОбработок", ВидОбработок);
	
	// В список внешних печатных форм добавляем макросные печатные формы
	Если ВидОбработок = Перечисления.ВидыДополнительныхОтчетовИОбработок.ПечатнаяФорма Тогда
		
		ТекстДобавленияТипаВКолонку = 
		"
		|ОБЪЕДИНИТЬ ВСЕ
        |
		|ВЫБРАТЬ ПЕРВЫЕ 0
		|	"""",
		|	"""",
		|	ЛОЖЬ,
		|	"""",
		|	"""",
		|	ЗНАЧЕНИЕ(Справочник.макрПечатныеФормы.ПустаяСсылка),
		|	ИСТИНА";
		
		Запрос.Текст = Запрос.Текст + Символы.ПС + ТекстДобавленияТипаВКолонку;
		
		НайденныеПечФормы = Запрос.Выполнить().Выгрузить();

		Если ЗначениеЗаполнено(ОбъектыНазначения) Тогда
			ОбъектНазначения = ОбъектыНазначения[0];
			
			//(Получаем соответствующий объект конфигурации
			ПустаяСсылка = Неопределено;                                
			Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектНазначения.Значение)) Тогда
				ПустаяСсылка = Справочники[ОбъектНазначения.Значение.Ссылка.Метаданные().Имя].ПустаяСсылка(); 
			ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектНазначения.Значение)) Тогда
				ПустаяСсылка = Документы[ОбъектНазначения.Значение.Ссылка.Метаданные().Имя].ПустаяСсылка();
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	макрОбъектыКонфигурации.Ссылка
			|ИЗ
			|	Справочник.макрОбъектыКонфигурации КАК макрОбъектыКонфигурации
			|ГДЕ
			|	макрОбъектыКонфигурации.СсылкаНаОбъект = &СсылкаНаОбъект";
			Запрос.УстановитьПараметр("СсылкаНаОбъект", ПустаяСсылка);
			Выборка = Запрос.Выполнить().Выбрать();
			
			ВидДокумента = Неопределено;
			Если Выборка.Следующий() Тогда
				ВидДокумента = Выборка.Ссылка;
			КонецЕсли;			
			//Получаем соответствующий объект конфигурации)
			
			//(Получаем макросные печатный формы			
			ЗапросПечатныеФормы = Новый Запрос;
			ЗапросПечатныеФормы.Текст = 
			"ВЫБРАТЬ
			|	макрПечатныеФормы.Ссылка
			|ИЗ
			|	Справочник.макрПечатныеФормы КАК макрПечатныеФормы
			|ГДЕ
			|	макрПечатныеФормы.ВладелецПФ = &ВладелецПФ
			|	И ОтборПоВладельцу
			|	И НЕ макрПечатныеФормы.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	макрПечатныеФормы.Наименование";
			
			Если ТипЗнч(ОбъектНазначения) = Тип("СправочникСсылка.энргАбоненты") Тогда
				ЗапросПечатныеФормы.Текст = СтрЗаменить(ЗапросПечатныеФормы.Текст, "ОтборПоВладельцу", "макрПечатныеФормы.ТипСтроения = &ТипСтроения");
				ЗапросПечатныеФормы.УстановитьПараметр("ТипСтроения", ОбъектНазначения.Значение.КлючПомещения.Строение.ТипСтроения);
			ИначеЕсли ТипЗнч(ОбъектНазначения.Значение.Ссылка) = Тип("ДокументСсылка.энргОперацияСЛицевымСчетом") Тогда 
				ЗапросПечатныеФормы.Текст = СтрЗаменить(ЗапросПечатныеФормы.Текст, "ОтборПоВладельцу", "макрПечатныеФормы.ТипСтроения = &ТипСтроения");
				ЗапросПечатныеФормы.УстановитьПараметр("ТипСтроения", ОбъектНазначения.Значение.КлючПомещения.Строение.ТипСтроения);
			Иначе
				ЗапросПечатныеФормы.Текст = СтрЗаменить(ЗапросПечатныеФормы.Текст, "ОтборПоВладельцу", "ИСТИНА");
			КонецЕсли;
			
			ЗапросПечатныеФормы.УстановитьПараметр("ВладелецПФ", ВидДокумента);
			
			Выборка = ЗапросПечатныеФормы.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = НайденныеПечФормы.Добавить();
				НоваяСтрока.Ссылка = Выборка.Ссылка;
				НоваяСтрока.БезопасныйРежим = Истина;
				НоваяСтрока.Представление = Выборка.Ссылка.Наименование;				
			КонецЦикла;		
			
		КонецЕсли;
		
		Возврат НайденныеПечФормы;
	
	Иначе
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ЗначениеСодержитСвойство(Значение, ИмяСвойства) Экспорт
	         
	GUIDПроверка = Новый УникальныйИдентификатор;
	СтруктураПроверка = Новый Структура(ИмяСвойства, GUIDПроверка);
		
	ЗаполнитьЗначенияСвойств(СтруктураПроверка, Значение);
	
	Если СтруктураПроверка[ИмяСвойства] = GUIDПроверка Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Процедура ОбработкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Обработки[ВыбраннаяСтрока].Ссылка) = Тип("СправочникСсылка.макрПечатныеФормы") Тогда
		Если ЗначениеЗаполнено(ОбъектыНазначения) Тогда
			энргОбщегоНазначенияКлиент.ПечатьМакросовОбъекта(ОбъектыНазначения[0].Значение, Обработки[ВыбраннаяСтрока].Ссылка);
		КонецЕсли;
	Иначе
		ВыполнитьОбработкуПоПараметрам();
	КонецЕсли;
	//Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
	//	Попытка
	//		ЭтаФорма.ВладелецФормы.Прочитать();
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	ТекДанные	=  Элементы.Обработки.ТекущиеДанные;
	
	Если НЕ ТекДанные = Неопределено И ТипЗнч(ТекДанные.Ссылка) = Тип("СправочникСсылка.макрПечатныеФормы") Тогда
		//ОповеститьОВыборе(Обработки[Элементы.Обработки.ТекущаяСтрока].Ссылка);
		Если ЗначениеЗаполнено(ОбъектыНазначения) Тогда
			энргОбщегоНазначенияКлиент.ПечатьМакросовОбъекта(ОбъектыНазначения[0].Значение, Обработки[Элементы.Обработки.ТекущаяСтрока].Ссылка);
		КонецЕсли;	
	Иначе
		ВыполнитьОбработкуПоПараметрам();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработкуПоПараметрам()
	
	ТекущиеДанные = Элементы.Обработки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГлобальныеОбработки Тогда
		ОбъектыНазначенияМассив = Неопределено;
	Иначе
		ОбъектыНазначенияМассив = ОбъектыНазначения.ВыгрузитьЗначения();
	КонецЕсли;
	
	//ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОбработку(
	//				ТекущиеДанные.Ссылка,
	//				ВидОбработокСтрока,
	//				ТекущиеДанные.Идентификатор,
	//				ТекущиеДанные.БезопасныйРежим,
	//				ТекущиеДанные.ВариантЗапуска,
	//				ТекущиеДанные.ПоказыватьОповещение,
	//				ТекущиеДанные.Модификатор,
	//				ОбъектыНазначенияМассив);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбработок()
	
	ЗначениеВРеквизитФормы(ПолучитьДоступныеКоманды(ЭтоНазначаемыеОбработки), "Обработки");
	
КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	
	Результат = ОткрытьФормуМодально("ОбщаяФорма.НастройкаМоихОтчетовИОбработок",
		Новый Структура("ВидОбработок,ЭтоГлобальныеОбработки,ТекущийРаздел", 
						ВидОбработок,
						ЭтоГлобальныеОбработки,
						ИмяРаздела
						) );
	
	Если ТипЗнч(Результат) = Тип("Булево") Тогда
		ЗаполнитьТаблицуОбработок();
	КонецЕсли;
	
КонецПроцедуры
